{
  "namespace": "TC-ACN",
  "description": "La 'Tassonomia Cyber dell’Agenzia per la Cybersicurezza Nazionale' (TC-ACN) definisce il linguaggio comune per lo scambio delle informazioni relative a eventi e minacce di cybersicurezza.",
  "version": 1,
  "predicates": [
    {
      "value": "BC-IM",
      "expanded": "Impact",
	  "description": "Il predicato Impact si riferisce alla perturbazione causata da un evento cyber."
    },
	{
      "value": "BC-RO",
      "expanded": "Root cause",
	  "description": "Il predicato Root cause categorizza le cause che hanno determinato uno specifico evento, sia di natura accidentale, sia deliberata."
    },
	{
      "value": "BC-SE",
      "expanded": "Severity",
	  "description": "Il predicato Severity ha lo scopo di indicare la gravità dell’impatto di un evento cyber. Questo predicato è associabile a quattro livelli, riferiti alla criticità dell’impatto subito."
    },
	{
      "value": "BC-SE",
      "expanded": "Victim geography",
	  "description": "Il predicato Victim geography identifica l’area geografica in cui si trovano i beni informatici interessati dall’evento cyber."
    },
	{
      "value": "TT-AC",
      "expanded": "Active scanning",
	  "description": "Il predicato Active scanning identifica tecniche utilizzate da attori malevoli che prevedono la scansione della rete attraverso un contatto diretto con il sistema o con la rete target."
    },
	{
      "value": "TT-AV",
      "expanded": "Availability",
	  "description": "In ambito informatico, per Availability (Disponibilità) si intende la capacità di un sistema informativo di garantire agli utenti autorizzati un accesso e un uso tempestivo e sempre fruibile delle informazioni. Tale predicato è in uso per specificare la causa dell’impatto sulla disponibilità."
    },
	{
      "value": "TT-FR",
      "expanded": "Fraud",
	  "description": "Il predicato Fraud identifica un’azione o una serie di azioni deliberatamente compiute con l’intento di ottenere un vantaggio economico o di altro tipo, attraverso l’inganno o la manipolazione."
    },
	{
      "value": "TT-BA",
      "expanded": "Brand Abuse",
	  "description": "Un’azione o una serie di azioni intenzionali che sfruttano il valore o la reputazione di un marchio per scopi malevoli, phishing, cybersquatting, typosquatting. Il Brand abuse può includere l’imitazione di siti web, l’uso non autorizzato di loghi o di marchi e la creazione di contenuti apparentamenti legittimi destinati a trarre in inganno gli utenti."
    },
	{
      "value": "TT-DE",
      "expanded": "Data exposure",
	  "description": "Il predicato Data exposure identifica gli eventi cyber in cui è occorsa una violazione di sicurezza dei dati/informazioni personali o proprietarie. L’evento si riferisce alla divulgazione involontaria o non autorizzata di dati sensibili, compromettendo la riservatezza e la sicurezza delle informazioni."
    },
	{
      "value": "TT-IG",
      "expanded": "Information gathering",
	  "description": "Per Information gathering si intendono le tecniche, tattiche o procedure che possono essere utilizzate da criminali informatici al fine di raccogliere quante più informazioni possibili su un determinato obiettivo, sia esso un utente, un’applicazione, un sistema o una rete."
    },
	{
      "value": "TT-MA",
      "expanded": "Malicious code",
	  "description": "Per Malicious code si intende un software o una porzione di codice potenzialmente dannosa, spesso inquadrabile come malware, che, una volta eseguito su un sistema, ha l’obiettivo di prenderne il controllo e/o comprometterne potenzialmente la riservatezza, l’integrità e la disponibilità."
    },
	{
      "value": "TT-SO",
      "expanded": "Social engineering",
	  "description": "Il predicato Social engineering identifica un evento di sicurezza informatica in cui un attore malevolo sfrutta un insieme di tecniche e tattiche per persuadere un individuo a compiere azioni che hanno conseguenze sul dominio cyber quali, ad esempio, il download di malware e la condivisione di informazioni personali o sensibili. Attività di Social Engineering fanno leva sulla componente psicologica ed emotiva della vittima per ottenere gli obiettivi prefissati."
    },
	{
      "value": "TT-VU",
      "expanded": "Vulnerability",
	  "description": "Il predicato Vulnerability identifica quale tipologia di vulnerabilità interessa un determinato prodotto o servizio o è connessa ad uno specifico evento cyber."
    },
	{
      "value": "TA-AM",
      "expanded": "Adversary motivation",
	  "description": "Adversary motivation identifica, se note al momento della condivisione, le motivazioni che hanno mosso l’attore malevolo nel compiere l’attività illecita o malevola."
    },
	{
      "value": "TA-AD",
      "expanded": "Adversary motivation",
	  "description": "Il predicato Adversary type identifica, se nota al momento della condivisione, la tipologia di attaccante o gruppo che ha perpetrato le azioni malevole o illecite."
    },
	{
      "value": "AD-AB",
      "expanded": "Abusive content",
	  "description": "Nell’ambito di un evento di sicurezza informatica, il predicato Abusive content identifica la presenza di materiale offensivo, illegale o non voluto inviato ad un utente con finalità di ferirne la sensibilità o la dignità. La diffusione di tale materiale può avvenire in maniera diretta, ad esempio tramite e-mail o sms, o in maniera indiretta, ad esempio tramite popup o pubblicità su Internet."
    },
	{
      "value": "AD-AS",
      "expanded": "Asset source geography",
	  "description": "Il predicato Asset source geography identifica la localizzazione geografica di beni informatici coinvolti in eventi cyber che sono stati identificati come “sorgenti” di attività malevole o illecite."
    },
	{
      "value": "AD-IN",
      "expanded": "Involved asset",
	  "description": "Il predicato Involved asset identifica le risorse coinvolte nell’evento cyber. I valori relativi a questo predicato possono indicare una o più risorse interessate dall’evento, anche in assenza di impatto."
    },
	{
      "value": "AD-OS",
      "expanded": "Operating system",
	  "description": "Il predicato Operating system identifica la piattaforma operativa software interessata da un determinato evento cyber."
    },
	{
      "value": "AD-OU",
      "expanded": "Outlook",
	  "description": "Il predicato Outlook ha l’obiettivo di fornire una prospettiva sull’impatto generato da un evento cyber al momento del rilevamento."
    },
	{
      "value": "AD-PH",
      "expanded": "Physical security",
	  "description": "Il predicato Physical security identifica gli eventi intenzionali, di natura fisica, con impatto su risorse e servizi informatici."
    },
	{
      "value": "AD-VE",
      "expanded": "Vector",
	  "description": "Il predicato Vector indica il vettore di attacco utilizzato in un evento cyber. In sicurezza informatica, si definisce vettore d’attacco la modalità con la quale un attore ostile tenta di ottenere l’accesso ad un bene informatico per effettuare attività malevole. Tra i vettori di attacco si annoverano genericamente tattiche, tecniche di attacco e mezzi informatici."
    },
  ],
  "values": [
        {
            "predicate": "BC:IM",
            "entry": [
                {
                    "value": "AC",
                    "expanded": "Account compromise",
                    "description": "Account compromise identifica gli eventi cyber che hanno avuto come effetto la compromissione di un account utente o di servizio. È possibile specificare il tipo di account compromesso utilizzando il predicato Involved asset"
                },
				{
                    "value": "AP",
                    "expanded": "Application compromise",
                    "description": "Application compromise identifica gli eventi cyber che hanno avuto come effetto la compromissione di un’applicazione o di un servizio, incluse applicazioni Web, Mobile, Database, ecc. È possibile specificare il tipo di application compromise utilizzando il predicato Involved asset."
                },
				{
                    "value": "AV",
                    "expanded": "Availability",
                    "description": "Availability identifica gli eventi nei quali le attività malevole condotte da un attaccante hanno causato effetti sulla disponibilità del sistema o servizio erogato. Nel caso in cui un evento cyber venga classificato utilizzando tale valore, dovrà essere esplicitato anche il predicato Availability."
                },
				{
                    "value": "DX",
                    "expanded": "Data exfiltration",
                    "description": "Data exfiltration identifica gli eventi cyber in cui è stata riscontrata la compromissione della riservatezza delle informazioni presenti su un bene informatico. Tale perdita o fuga dei dati può avvenire a causa di attività malevole, ad esempio a seguito di una compromissione di un file server, oppure accidentalmente, nel caso di un database esposto su Internet senza un accurato processo di autenticazione."
                },
				{
                    "value": "DE",
                    "expanded": "Data exposure",
                    "description": "Data exposure si riferisce alla divulgazione non autorizzata di dati sensibili o riservati, causata da vulnerabilità di sicurezza, errori di configurazione o pratiche inadeguate di gestione delle informazioni. Questo fenomeno può portare alla diffusione di informazioni personali, finanziarie 16 La Tassonomia Cyber dell’ACN o aziendali aumentando il rischio di furti di identità, frodi o danni reputazionali per individui e organizzazioni."
                },
				{
                    "value": "DM",
                    "expanded": "Data manipulation",
                    "description": "Data manipulation identifica gli eventi cyber in cui è stata riscontrata la compromissione dell’integrità delle informazioni presenti su un bene informatico. Tale valore include la modifica o la distruzione dei dati da parte di un attore malevolo."
                },
				{
                    "value": "NO",
                    "expanded": "No impact",
                    "description": "No impact identifica un evento cyber che avrebbe potuto compromettere la disponibilità, l’autenticità, l’integrità o la riservatezza di dati conservati, trasmessi o elaborati o dei servizi offerti dai sistemi informatici e di rete o accessibili attraverso di essi, ma che è stato efficacemente evitato o non si è verificato. Un esempio è la ricezione di una e-mail di phishing riconosciuta come tale dall’utente e pertanto sostanzialmente priva di effetti."
                },
				{
                    "value": "SY",
                    "expanded": "System compromise",
                    "description": "System compromise identifica gli eventi cyber che hanno avuto come effetto la compromissione di un bene informatico, ad esempio alterandone l’integrità."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Impact non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "BC:RO",
            "entry": [
                {
                    "value": "HU",
                    "expanded": "Human errors",
                    "description": "Human errors identifica gli eventi provocati da un errore umano non intenzionale. Un esempio è un’errata operazione che influisce sulla prevista funzionalità di un bene informatico."
                },
				{
                    "value": "MA",
                    "expanded": "Malicious actions",
                    "description": "Malicious actions identifica qualsiasi tentativo di compromettere l’integrità, la confidenzialità o la disponibilità di un bene informatico."
                },
				{
                    "value": "NA",
                    "expanded": "Natural phenomena",
                    "description": "Natural phenomena identifica gli eventi causati da un fenomeno naturale, come ad esempio, terremoti, valanghe ed esondazioni."
                },
				{
                    "value": "SY",
                    "expanded": "System failure",
                    "description": "System failure identifica un evento non previsto, in cui un sistema cessa di funzionare secondo le specifiche progettuali previste, comportando una perdita di servizio o una riduzione significativa della qualità del servizio fornito."
                },
				{
                    "value": "TH",
                    "expanded": "Third party failure",
                    "description": "Third party failure identifica l’interruzione o degradazione delle prestazioni di un sistema principale attribuibile a disfunzioni o guasti di servizi forniti da terze parti."
                }
            ]
        },
        {
            "predicate": "BC:SE",
            "entry": [
                {
                    "value": "HI",
                    "expanded": "High",
                    "description": "High identifica un evento cyber riferito ad una delle seguenti condizioni: • l’organizzazione non è più in grado di fornire uno o più servizi essenziali agli utenti; • dati/informazioni personali o proprietarie sono stati modificati, cancellati o esfiltrati; • il ripristino dall’incidente non è possibile (ad esempio, dati sensibili esfiltrati e diffusi, non recuperabili a seguito di un evento ransomware)."
                },
				{
                    "value": "ME",
                    "expanded": "Medium",
                    "description": "Medium identifica un evento cyber riferito ad una delle seguenti condizioni: • l’organizzazione è in grado di erogare un servizio essenziale solo ad una parte dell’utenza; • è stato rilevato l’accesso e l’esfiltrazione a dati/informazioni personali o proprietarie; • il ripristino è possibile con tempistiche non note in quanto, ad esempio, sono necessarie risorse aggiuntive o supporto esterno."
                },
				{
                    "value": "LO",
                    "expanded": "Low",
                    "description": "Low identifica un evento cyber riferito ad una delle seguenti condizioni: • l’organizzazione può ancora fornire tutti i servizi essenziali a tutti gli utenti, ma risultano non ottimali in termini di efficienza; • è stato rilevato l’accesso a dati/informazioni sensibili o proprietarie; • il ripristino è possibile con tempistiche note, anche tramite risorse aggiuntive."
                },
				{
                    "value": "NO",
                    "expanded": "None",
                    "description": "None identifica un evento cyber riferito ad una delle seguenti condizioni: • nessun effetto sulla capacità dell’organizzazione di erogare i servizi agli utenti; • nessuna informazione è stata oggetto di accesso non autorizzato, esfiltrazione, modifica o cancellazione; • il tempo necessario per il ripristino è prevedibile con le risorse esistenti."
                }
            ]
        },
        {
            "predicate": "BC:VG",
            "entry": [
                {
                    "value": "IT",
                    "expanded": "Italy",
                    "description": "Italy indica che l’evento cyber ha avuto un impatto su beni informatici localizzati in Italia."
                },
				{
                    "value": "AF",
                    "expanded": "Africa",
                    "description": "Africa indica che l’evento cyber ha avuto un impatto su beni informatici localizzati geograficamente sul continente africano. "
                },
				{
                    "value": "AM",
                    "expanded": "America",
                    "description": "America indica che l’evento cyber ha avuto un impatto su beni informatici localizzati geograficamente sul continente americano. "
                },
				{
                    "value": "AN",
                    "expanded": "Antarctic",
                    "description": "Antartica indica che l’evento cyber ha avuto un impatto su beni informatici localizzati geograficamente sul continente antartico. "
                },
				{
                    "value": "AS",
                    "expanded": "Asia",
                    "description": "Asia indica che l’evento cyber ha avuto un impatto su beni informatici localizzati geograficamente sul continente asiatico."
                },
				{
                    "value": "GL",
                    "expanded": "Global",
                    "description": "Global indica che l’evento cyber ha avuto un impatto su beni informatici distribuiti in più paesi o ha un potenziale impatto globale."
                },
				{
                    "value": "OC",
                    "expanded": "Oceania",
                    "description": "Oceania indica che l’evento cyber ha avuto un impatto su beni informatici localizzati nella zona continentale Oceania. "
                },
				{
                    "value": "EU",
                    "expanded": "Europe",
                    "description": "Europe indica che l’evento cyber ha avuto un impatto su beni informatici localizzati geograficamente sul continente europeo. "
                }
            ]
        },
        {
            "predicate": "TT:AC",
            "entry": [
                {
                    "value": "CR",
                    "expanded": "Credential scanning",
                    "description": "Credential scanning identifica gli eventi cyber in cui un attore malevolo effettua una scansione attiva per rilevare credenziali di autenticazione deboli, impropriamente configurate oppure esposte su un bene informatico. Questo tipo di attività include diverse tipologie di eventi, quali gli attacchi a forza bruta, volti a individuare la password di uno o più account specifici, oppure attacchi di account discovery, mirati alla scoperta di account validi o realmente esistenti sul sistema target."
                },
				{
                    "value": "NE",
                    "expanded": "Network scanning",
                    "description": "Network scanning identifica gli eventi cyber in cui un attore malevolo utilizza tecniche e procedure mirate a identificare la presenza di servizi in esecuzione su beni informatici remoti o connessi all’infrastruttura target. Questa categoria di evento comprende la scansione delle porte (port scan), la mappatura della rete (network mapping) e la rilevazione del sistema operativo (OS fingerprinting)."
                },
				{
                    "value": "VU",
                    "expanded": "Vulnerability scanning",
                    "description": "Vulnerability scanning identifica gli eventi cyber in cui un attore malevolo utilizza tecniche e procedure mirate in modo specifico all’individuazione di vulnerabilità presenti in un bene informatico al fine di mappare la superficie d’attacco. "
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi ad Active scanning non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:AV",
            "entry": [
                {
                    "value": "DA",
                    "expanded": "Data encryption",
                    "description": "Data encryption identifica gli eventi cyber in cui un attore malevolo applica algoritmi di cifraturaai dati custoditi in un sistema informatico compromesso, senza il consenso del proprietario, alfine di renderli inaccessibili. Tale attività comporta principalmente un impatto sulla disponibilitàdei dati presenti sul bene informatico e sull’erogazione dei servizi. Un esempio di tale evento è lacifratura dei dati di un sistema informatico a seguito dell’esecuzione di un ransomware."
                },
				{
                    "value": "DO",
                    "expanded": "DoS",
                    "description": "Denial of Service (DoS) identifica gli eventi cyber in cui un attore malevolo effettua un attacco che mira a compromettere la disponibilità di un bene informatico o di un servizio mediante esaurimento delle sue risorse di rete, di elaborazione o di memoria."
                },
				{
                    "value": "DD",
                    "expanded": "DDoS",
                    "description": "Distributed Denial of Service (DDoS) identifica gli eventi cyber in cui un attore malevolo effettua un attacco, da sorgenti multiple e distribuite, che mira a compromettere la disponibilità di un bene informatico o un di servizio mediante esaurimento delle sue risorse di rete, di elaborazione o di memoria."
                },
				{
                    "value": "MI",
                    "expanded": "Misconfiguration",
                    "description": "Misconfiguration identifica gli eventi cyber non malevoli in cui una configurazione errata o non ottimale di un bene informatico o di una sua componente ha compromesso la disponibilità di un servizio. Un caso d’esempio è un’errata configurazione di un componente di rete che potrebbe causare la perdita totale o parziale di erogazione di un servizio. È importante evidenziare che la disponibilità è stata compromessa a causa di un’azione non intenzionale e quindi non malevola, pertanto, tale predicato è comunemente associato al valore Human errors (§ 3.1.2.1) del predicato Root cause."
                },
				{
                    "value": "OU",
                    "expanded": "Outage",
                    "description": "Outage identifica gli eventi cyber non malevoli in cui si è riscontrata la perdita totale o parziale della disponibilità di un bene informatico a causa di eventi naturali o causati dall’uomo. Possibili cause di un evento di indisponibilità possono essere l’avvenimento di un disastro naturale, il mancato funzionamento dei sistemi di refrigerazione di un datacenter oppure un guasto elettrico. È importante evidenziare che la disponibilità è stata compromessa a causa di un’azione non intenzionale e quindi non malevola."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber nei quali si riscontra una perdita di disponibilità di un bene informatico o di un applicativo per una causa che non rientra in quelle indicate negli altri valori associabili al predicato Availability."
                }
            ]
        },
        {
            "predicate": "TT:FR",
            "entry": [
                {
                    "value": "BR",
                    "expanded": "Brand abuse",
                    "description": "Brand abuse identifica un’attività fraudolenta in cui un attore malevolo sfrutta la notorietà di un’organizzazione per creare falsi siti web, false campagne pubblicitarie o false partnership con il proposito di danneggiarne la reputazione o di condurre attività di criminalità informatica. Tra gli esempi rientrano: la creazione di profili o gruppi falsi sui social media che sfruttano illecitamente il brand o il logo di un’azienda, la creazione di applicazioni mobili ingannevoli o la distribuzione di pubblicità non autorizzate."
                },
				{
                    "value": "EX",
                    "expanded": "Extortion",
                    "description": "Extortion identifica, nel contesto della sicurezza informatica, l’attività criminale in cui un aggressore esercita coercizione su un individuo o un’organizzazione per ottenere benefici finanziari o altre forme di compensazione. La condotta viene attuata tramite l’esercizio della minaccia di causare danni o di divulgare informazioni sensibili. Un esempio di questa pratica è il ransomware, un tipo di malware che cifra i dati della vittima rendendoli inaccessibili, utilizzato per costringere la vittima a pagare un riscatto, di solito in criptovalute, in cambio della chiave di decifratura. Altre forme di estorsione possono includere la minaccia di diffusione di dati personali o aziendali, qualora non vengano soddisfatte le richieste dell’aggressore."
                },
				{
                    "value": "MA",
                    "expanded": "Masquerade",
                    "description": "Masquerade indica un’attività fraudolenta in cui un attore malevolo assume l’identità di un altro utente, dispositivo o entità all’interno di una rete o sistema informatico, al fine di eludere i meccanismi di sicurezza e acquisire accessi non autorizzati a risorse o beni informatici. Tale attacco implica l’utilizzo fraudolento di credenziali, indirizzi di rete, token di autenticazione o altri dati identificativi utili per impersonare una fonte autorizzativa fidata. Un tipico caso è rappresentato da un attaccante che invia un’e-mail a un dipendente aziendale fingendo di essere il CEO dell’azienda e richiede con urgenza un trasferimento di fondi per una transazione aziendale critica o la divulgazione di informazioni riservate, come dati finanziari o dati dei clienti."
                },
				{
                    "value": "RE",
                    "expanded": "Resource misuse",
                    "description": "Resource misuse identifica gli eventi cyber in cui un attore malevolo ha sfruttato in maniera non autorizzata le risorse di un computer o di una rete per scopi illeciti. Un tipico esempio è rappresentato da un dipendente che sfrutta il suo accesso ai sistemi aziendali per eseguire programmi che estraggono criptovalute (mining) oppure per effettuare attacchi informatici ai danni di soggetti terzi."
                },
				{
                    "value": "SP",
                    "expanded": "Spam",
                    "description": "Spam identifica gli eventi cyber in cui un attore malevolo invia messaggi pubblicitari indesiderati o non richiesti, generalmente di carattere commerciale. I messaggi di spam possono essere inviati attraverso qualunque sistema di comunicazione, tra cui messaggi di posta elettronica, SMS, chat, forum e social media."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi al predicato Fraud non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:BA",
            "entry": [
                {
                    "value": "AI",
                    "expanded": "Account impersonation",
                    "description": "Account impersonation si riferisce all’attività in cui un attore malevolo si finge un’altra persona, sistema o organizzazione per ingannare la vittima e ottenere l’accesso non autorizzato a informazioni sensibili. Questa attività può includere sia la compromissione di un account esistente, sia la creazione di un nuovo profilo affine."
                },
				{
                    "value": "CS",
                    "expanded": "Cybersquatting",
                    "description": "Cybersquatting si riferisce alla pratica di registrare e utilizzare abusivamente un nome di dominio Internet identico o simile a marchi registrati, nomi di servizi, nomi personali o aziendali, con l’intento malevolo di deviare il traffico verso altri siti per ricavarne un profitto economico, diffondere malware o rubare proprietà intellettuale."
                },
				{
                    "value": "NI",
                    "expanded": "Name-logo-impersonation",
                    "description": "Name-logo-impersonation si riferisce all’atto deliberato di replicare o imitare in modo fraudolento il nome e il logo di un’entità riconosciuta, come un’organizzazione rinomata o un servizio noto, nell’intento di trarre in inganno la vittima. Questa tecnica è impiegata prevalentemente nelle strategie di phishing o in altri schemi di ingegneria sociale."
                },
				{
                    "value": "TS",
                    "expanded": "Typosquatting",
                    "description": "Typosquatting, conosciuto anche come “URL hijacking”, è una pratica fraudolenta nell’ambito della sicurezza informatica che si verifica quando un attore malevolo registra deliberatamente nomi di dominio che imitano siti web esistenti con lievi variazioni ortografiche. Questo fenomeno sfrutta gli errori di digitazione che gli utenti commettono durante la battitura degli indirizzi web nel browser. Questa pratica può essere utilizzata per una serie di attività fraudolente, tra cui deviare il traffico verso altri siti, phishing o la diffusione di malware."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Brand abuse non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:DE",
            "entry": [
                {
                    "value": "AU",
                    "expanded": "Authentication data",
                    "description": "Authentication data identifica gli eventi cyber nei quali è stata identificata una violazione di sicurezza dei dati relativi all’autenticazione degli utenti del bene informatico impattato, come username e password."
                },
				{
                    "value": "BU",
                    "expanded": "Business data",
                    "description": "Business data identifica gli eventi cyber nei quali è stata identificata una violazione di sicurezza dei dati relativi all’azienda, quali dati sulle sue attività, sui suoi contratti, sulla proprietà intellettuale, ecc."
                },
				{
                    "value": "FI",
                    "expanded": "Financial data",
                    "description": "Financial data identifica gli eventi cyber nei quali è stata identificata una violazione di sicurezza dei dati relativi alla sfera finanziaria dell’azienda, come entrate, uscite, dati di transazioni finanziarie, dati relativi a carte di credito, ecc."
                },
				{
                    "value": "PD",
                    "expanded": "Personal data",
                    "description": "Personal data identifica gli eventi cyber nei quali si è verificata una violazione di sicurezza dei personali, ovvero delle informazioni che identificano o rendono identificabile, direttamente o indirettamente, una persona fisica e che possono fornire informazioni sulle sue caratteristiche, le sue abitudini, il suo stile di vita, le sue relazioni personali, il suo stato di salute, la sua situazione economica, ecc."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Information disclosure non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:IG",
            "entry": [
                {
                    "value": "AC",
                    "expanded": "Active scanning",
                    "description": "Active scanning identifica gli eventi cyber in cui un attore malevolo cerca di raccogliere informazioni mediante una scansione attiva, ossia attraverso contatti diretti con il bene informatico target. Per specificare i dettagli sulla tipologia di scansione attiva si utilizza il predicato Active scanning."
                },
				{
                    "value": "SN",
                    "expanded": "Sniffing",
                    "description": "Sniffing identifica gli eventi cyber in cui un attore non autorizzato utilizza tecniche o strumenti atti ad acquisire pacchetti di rete con il fine di rubare dati, monitorare attività di rete e raccogliere informazioni. Un esempio di eventi identificabili con tale valore è l’osservazione non autorizzata di informazioni d’interesse come ad esempio, header, credenziali o token di accesso non cifrati inviati in rete."
                },
				{
                    "value": "SO",
                    "expanded": "Social engineering",
                    "description": "Social engineering identifica gli eventi cyber in cui un attore malevolo utilizza un insieme di tecniche e tattiche per persuadere un individuo a compiere determinate azioni per diverse finalità, tra le quali si evidenziano le seguenti: • ottenere informazioni personali; • ottenere credenziali di accesso; • indurre l’utente a compiere azioni come, ad esempio, installare malware. Attività di social engineering fanno leva sulla componente psicologica ed emotiva della vittima per ottenere gli obiettivi prefissati."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Information gathering non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:MA",
            "entry": [
                {
                    "value": "BA",
                    "expanded": "Backdoor",
                    "description": "Una Backdoor è una tipologia di malware che garantisce un accesso secondario a un bene informatico compromesso, consentendo all’attaccante di accedervi da remoto ed eseguire azioni arbitrarie, come il trasferimento di file o l’esecuzione di comandi."
                },
				{
                    "value": "BK",
                    "expanded": "Banker",
                    "description": "Un Banker, anche noto come banking trojan, è una tipologia di malware che tenta di sottrarre illecitamente le credenziali dei clienti di istituti bancari o di ottenere l’accesso alle loro informazioni finanziarie, tipicamente intercettando le comunicazioni del browser"
                },
				{
                    "value": "BO",
                    "expanded": "Bot",
                    "description": "Un Bot è un programma informatico progettato per adempiere ad un preciso scopo, sia esso lecito o dannoso. In questo secondo caso, si parla di bot malware, ovvero strumenti utilizzati da criminali informatici per creare una rete di computer zombie, nota come botnet, ed effettuare un insieme di attività malevole di diversa natura. Spesso i bot vengono installati sulle macchine target a insaputa dell’utente."
                },
				{
                    "value": "CO",
                    "expanded": "Coin miner",
                    "description": "Un Coin miner è una tipologia di malware che sfrutta la potenza di calcolo del bene informatico target per estrarre criptovalute a insaputa dell’utente."
                },
				{
                    "value": "EX",
                    "expanded": "Exploit kit",
                    "description": "Un Exploit kit è un insieme di strumenti software progettati per sfruttare le vulnerabilità presenti in una rete, in un sistema o in un’applicazione. In sicurezza informatica, questi strumenti sono utilizzati dagli attaccanti per eseguire e automatizzare numerose tecniche e procedure di attacco al fine di accedere, infettare e danneggiare i beni informatici."
                },
				{
                    "value": "HA",
                    "expanded": "Hacking tool",
                    "description": "Un Hacking tool è un programma progettato per violare le misure di sicurezza di un bene informatico. È utilizzato sia per attività di natura legittima (ad esempio per valutare la sicurezza di un bene informatico in un’attività di tipo red team) sia in contesti non autorizzati o per scopi illeciti. Alcuni esempi sono PsExec, Mimikatz, Cobalt Strike e LOIC."
                },
				{
                    "value": "IN",
                    "expanded": "Information stealer",
                    "description": "Un Information stealer è una tipologia di malware che ha lo scopo di raccogliere informazioni su un bene informatico in maniera illegittima. Queste informazioni possono includere credenziali di accesso, dati personali e informazioni finanziarie. I malware noti come keylogger o spyware rientrano in questa classificazione."
                },
				{
                    "value": "LO",
                    "expanded": "Loader",
                    "description": "Un Loader è una tipologia di malware che permette di scaricare ed eseguire malware aggiuntivi sul bene informatico compromesso. I malware noti come dropper e downloader rientrano in questa classificazione."
                },
				{
                    "value": "PO",
                    "expanded": "Potentially Unwanted Program",
                    "description": "Un Potentially Unwanted Program, noto anche come PUP o PUA (Potentially Unwanted Application), può essere considerato come un software indesiderato secondo le preferenze dell’utente. Sebbene questa classificazione non indichi la presenza di un malware, i PUP possono rappresentare una minaccia per la privacy e la sicurezza del sistema e dell’utente."
                },
				{
                    "value": "RA",
                    "expanded": "Ransomware",
                    "description": "Il Ransomware è una tipologia di minaccia che ha lo scopo di cifrare i dati del bene informatico target in modo da comprometterne la disponibilità e l’integrità. Inoltre, in questa tipologia di minaccia spesso l’attaccante crea dei file, detti ransom notes, tramite i quali viene richiesto alla vittima un riscatto in cambio dell’accesso ai propri dati. In alcuni casi i dati, prima di essere cifrati, vengono esfiltrati in modo da offrire all’attaccante uno strumento in più di ricatto nei confronti della vittima"
                },
				{
                    "value": "RE",
                    "expanded": "Remote Access Tool",
                    "description": "Un RAT, acronimo di Remote Access Tool, è una tipologia di malware che consente all’attaccante di controllare un bene informatico target da remoto. Questa tipologia di codice malevolo permette di eseguire varie azioni non autorizzate, come l’acquisizione di dati, il trasferimento di file e l’esecuzione di comandi arbitrari."
                },
				{
                    "value": "RO",
                    "expanded": "Rootkit",
                    "description": "Un Rootkit è una tipologia di malware tipicamente sofisticato progettato per infiltrarsi all’interno di un sistema operativo o di un’applicazione, mascherando la sua presenza e ottenendo privilegi di accesso elevati. Un rootkit ha la caratteristica di infettare e modificare le funzioni del sistema operativo e le sue strutture dati. In sicurezza informatica, le caratteristiche del rootkit permettono di evadere i controlli dell’antivirus e di garantire persistenza a lungo termine sui sistema target."
                },
				{
                    "value": "TR",
                    "expanded": "Trojan",
                    "description": "Un Trojan è una tipologia di software che si presenta all’utente sotto forma di programma legittimo o comunque non dannoso, ma che una volta eseguito ha lo scopo di scaricare e avviare sul bene informatico target un ulteriore software malevolo. I trojan sono progettati per ingannare gli utenti e possono svolgere una vasta gamma di funzioni malevole, come il furto di informazioni, il controllo remoto del sistema, l’installazione di altri malware o la creazione di backdoor per consentire l’accesso non autorizzato."
                },
				{
                    "value": "UN",
                    "expanded": "Unknown",
                    "description": "Unknown identifica una tipologia di codice malevolo per cui non si hanno informazioni sufficienti a indicarne la natura. Tale valore si utilizza in eventi cyber in cui è stata riscontrata la l’esecuzione di codice malevolo o malware ma non è ancora in grado di stabilirne la tipologia."
                },
				{
                    "value": "VI",
                    "expanded": "Virus",
                    "description": "Un Virus è un software potenzialmente dannoso che, quando eseguito su un bene informatico, ha l’obiettivo di autoreplicarsi modificando (infettando) i programmi in esecuzione e alterandone (injection) il funzionamento. Utilizzando un virus, un attaccante potrebbe eliminare i dati e/o i programmi presenti su un bene informatico, bloccarne l’accesso o attuare tecniche di compromissione avanzate per garantirsi persistenza sul sistema e permetterne la raggiungibilità da remoto (i.e. installando una backdoor)."
                },
				{
                    "value": "WE",
                    "expanded": "Webshell",
                    "description": "Una Webshell è una tipologia di script o programma che viene installato su un server web compromesso al fine di ottenere un accesso non autorizzato e persistente sul bene informatico."
                },
				{
                    "value": "WI",
                    "expanded": "Wiper",
                    "description": "Il Wiper è una tipologia di malware il cui obiettivo principale è quello di eliminare in modo irreversibile dati e file presenti su un bene informatico compromesso. A differenza di altri tipi di malware che cercano di rubare informazioni o estorcere denaro, il wiper ha come obiettivo principale l’eliminazione dei dati, spesso con l’intento di causare danni irreparabili o di sabotare le attività di un’organizzazione."
                },
				{
                    "value": "WO",
                    "expanded": "Worm",
                    "description": "Il Worm è un software potenzialmente dannoso che l’attaccante può sfruttare per replicare un malware all’interno di un bene informatico per comprometterne le funzionalità. La caratteristica principale del worm è la capacità di autoreplicarsi su una rete, senza richiedere l’interazione diretta dell’utente. I worm, a differenza di altri tipi di malware come i virus, possono propagarsi in modo indipendente e autonomo, ad esempio sfruttando le vulnerabilità dei beni informatici o le funzionalità di condivisione di file e risorse di rete."
                },
            ]
        },
        {
            "predicate": "TT:SO",
            "entry": [
                {
                    "value": "BA",
                    "expanded": "Baiting",
                    "description": "Baiting identifica attività fraudolente in cui un attore malevolo attira la vittima mediante un’esca, come la promessa della ricezione di un bene o l’ottenimento di un vantaggio. La superficie di attacco comprende sia il mondo online sia la vita reale. In questi casi, l’attaccante tenta di sfruttare la curiosità umana per convincere la vittima ad effettuare azioni quali, ad esempio, l’inserimento di dati personali su falsi servizi online, il download di malware occultato da applicazioni e contenuti leciti, oppure tramite dispositivi USB utilizzati come esca"
                },
				{
                    "value": "PH",
                    "expanded": "Phishing",
                    "description": "Phishing identifica gli eventi cyber in cui un utente viene contattato, tramite e-mail o altri strumenti di messaggistica, da un attore malevolo allo scopo di condurre la vittima all’esecuzione di codice malevolo o a visitare risorse artefatte con lo scopo di carpire dati personali, bancari o credenziali di accesso, trasferire somme di denaro. Gli eventi di phishing possono anche essere il preludio o una componente di attacchi informatici più ampi e complessi."
                },
				{
                    "value": "SM",
                    "expanded": "Smishing",
                    "description": "Smishing identifica gli eventi cyber in cui un utente viene contattato, tramite l’invio di brevi messaggi di testo (SMS), da un attore malevolo allo scopo di condurre la vittima all’esecuzione di codice malevolo come false applicazioni mobile o a visitare risorse artefatte con lo scopo di carpire dati personali, bancari o credenziali di accesso, trasferire somme di denaro. Gli eventi di smishing possono anche essere il preludio o una componente di attacchi informatici più ampi e complessi."
                },
				{
                    "value": "SP",
                    "expanded": "Spear-phishing",
                    "description": "Spear-phishing è una tipologia di phishing contro target di specifico interesse che prevede l’invio di un messaggio altamente personalizzato da un account di posta elettronica apparentemente noto alla vittima, con l’intento di carpire informazioni sensibili, ovvero indurla ad aprire/scaricare 33 La Tassonomia Cyber dell’ACN allegati o link malevoli. Allo spear-phishing possono essere associate tecniche di ingegneria sociale, tra cui il monitoraggio delle relazioni e delle abitudini sui social media del soggetto d’interesse."
                },
				{
                    "value": "VI",
                    "expanded": "Vishing",
                    "description": "Vishing identifica gli eventi cyber in cui un utente viene contattato, tramite sistemi di comunicazione vocale, da un attore criminale allo scopo di condurre la vittima all’esecuzione di codice malevolo o di carpire dati aziendali, personali, bancari o credenziali di accesso, trasferire somme di denaro o anche solo come “ponte” per ulteriori attacchi."
                },
				{
                    "value": "WA",
                    "expanded": "Watering-hole",
                    "description": "Watering-hole identifica gli eventi cyber nel quale un attaccante mira a compromettere un gruppo specifico di utenti attraverso l’infezione di siti web che sono noti per essere regolarmente visitati da tale gruppo. L’obiettivo di questa tipologia di attacchi è quello di colpire la vittima in modo indiretto tramite la compromissione dell’applicazione Web interessata."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Social engineering non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TT:VU",
            "entry": [
                {
                    "value": "0-",
                    "expanded": "0-day vulnerability",
                    "description": "0-day vulnerability identifica che un determinato bene informatico è affetto da una vulnerabilità LNE A ILIT N day vulnerability (TT: U N ) Proof of concept (TT: U PC) 0 day vulnerability (TT: U 0 ) T EAT T PE TT Unwanted exposed services (TT: U UN) Weak cryptography (TT: U WE) Other (TT: U OT) Security misconfiguration (TT: U SE) non nota pubblicamente, che quindi potrebbe essere sfruttata da un attaccante per compromettere un sistema informativo e minarne l’integrità, la riservatezza e la disponibilità."
                },
				{
                    "value": "N-",
                    "expanded": "N-day vulnerability",
                    "description": "N-day vulnerability identifica una vulnerabilità 0-day che è stata resa pubblica da più di un giorno, indipendentemente dal rilascio del software correttivo. Generalmente, in questi casi, anche successivamente alla pubblicazione della falla di sicurezza un attaccante potrebbe sfruttare la vulnerabilità per compromettere i beni informatici affetti prima che venga attuata la risoluzione tramite il relativo aggiornamento o l’eventuale workaround."
                },
				{
                    "value": "PC",
                    "expanded": "Proof-of-concept",
                    "description": "Proof-of-concept identifica, nel contesto della sicurezza informatica, la disponibilità di una dimostrazione tecnica realizzata per validare la presenza di una vulnerabilità teorica, dimostrando come essa possa essere sfruttata in un software o in un sistema informatico."
                },
				{
                    "value": "SE",
                    "expanded": "Security misconfiguration",
                    "description": "Security misconfiguration indica che la configurazione errata di un bene informatico può portare a rischi di sicurezza e provocare falle che possono essere facilmente sfruttate da un criminale informatico per compromettere un sistema. Alcuni esempi di Security misconfiguration sono il mancato hardening dei sistemi, un’errata gestione dei permessi o l’installazione e abilitazione di funzionalità non adeguatamente protette."
                },
				{
                    "value": "UN",
                    "expanded": "Unwanted exposed services",
                    "description": "Unwanted exposed services indica che il bene informatico coinvolto nell’evento di sicurezza espone servizi di rete generalmente non raccomandati in quanto in grado di ampliare la superficie di attacco e, se non adeguatamente protetti, possono inficiare sulla postura di sicurezza. Si tratta di servizi sfruttabili da attori malevoli per penetrare all’interno della rete delle vittime o tali da agevolare, ad esempio, attacchi di tipo DDoS reflection."
                },
				{
                    "value": "WE",
                    "expanded": "Weak cryptography",
                    "description": "Weak cryptography identifica gli eventi cyber relativi all’utilizzo improprio o non corretto dei meccanismi di sicurezza legati alla crittografia. Tecniche di cifratura che impiegano algoritmi di crittografia deboli possono fornire una sicurezza inadeguata contro gli attacchi informatici tali da comportare l’esposizione di dati sensibili, la perdita di chiavi, l’interruzione dell’autenticazione, sessioni non sicure e facilitare attacchi di spoofing."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Vulnerability non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TA:AM",
            "entry": [
                {
                    "value": "DE",
                    "expanded": "Destruction",
                    "description": "Destruction identifica gli eventi cyber nei quali un attaccante ha condotto attività malevole o illecite volte a danneggiare un bene informatico, al fine di comprometterne il funzionamento, di interrompere l’erogazione totale o parziale dei servizi forniti o di impedirne l’accesso al personale autorizzato. Un esempio di evento cyber dimostrativo per queste caratteristiche è rappresentato dagli attacchi che prevedono l’utilizzo di malware di tipo wiper. È importante evidenziare che gli eventi ransomware non possono essere identificati con questo valore poiché in tali casi, solitamente, l’avversario è mosso da interessi economici e pertanto non è interessato al mero danneggiamento."
                },
				{
                    "value": "ES",
                    "expanded": "Espionage",
                    "description": "Espionage identifica gli eventi cyber nei quali un attaccante ha condotto un’attività indebita finalizzata all’acquisizione di dati/informazioni sensibili, proprietarie o classificate al fine di conseguire un guadagno economico, un vantaggio competitivo o per ragioni politiche. In questa categoria rientrano, ad esempio, la sottrazione di segreti industriali, di informazioni classificate o di proprietà intellettuale."
                },
				{
                    "value": "ID",
                    "expanded": "Ideology",
                    "description": "Ideology identifica gli eventi cyber nei quali un attaccante ha condotto attività malevole o illecite per diffondere un messaggio di natura ideologica all’organizzazione colpita, ai fruitori del servizio 36 La Tassonomia Cyber dell’ACN impattato o a qualunque terza parte anche non direttamente coinvolta nell’illecito. Gli eventi cyber che appartengono a questa categoria vengono spesso compiuti dai cosiddetti hacktivisti. A tal proposito di rimanda al valore Hacktivist del predicato Adversary type."
                },
				{
                    "value": "IN",
                    "expanded": "Influence and disinformation",
                    "description": "Influence and disinformation identifica gli eventi cyber nei quali avviene diffusione intenzionale di notizie o informazioni inesatte o distorte allo scopo di influenzare le azioni e le scelte di qualcuno."
                },
				{
                    "value": "PR",
                    "expanded": "Profit",
                    "description": "Profit identifica gli eventi cyber in cui un attaccante o un gruppo effettua azioni malevole o illecite al fine di ottenerne in modo diretto o indiretto un profitto. Alcuni esempi: • richiesta di riscatto in denaro in caso di ransomware; • richiesta di riscatto in denaro in caso di sextortion; • phishing finalizzato alla sottrazione di dati bancari; • infezione con malware di tipo trojan bancari."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi ad Adversary motivation non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "TA:AD",
            "entry": [
                {
                    "value": "CR",
                    "expanded": "Criminal",
                    "description": "Criminal identifica gli eventi cyber in cui l’attaccante o il gruppo che ha causato l’evento può essere categorizzato nella tipologia più generica di “criminale” i cui scopi tendono a generare un profitto dalle azioni svolte."
                },
				{
                    "value": "HA",
                    "expanded": "Hacktivist",
                    "description": "Hacktivist identifica gli eventi cyber in cui è previsto l’uso sovversivo di strumenti digitali al fine di promuovere un’agenda politica o principi di connotazione sociale. Questi gruppi utilizzano tecniche di hacking ad esempio per: • attaccare siti web per compromettere l’erogazione di servizi o alterarne i contenuti per diffondere messaggi di natura politica o ideologica; • pubblicare dati governativi classificati per denunciare la mancanza di protezione dei dati da parte delle autorità; • reindirizzare gli utenti su siti gestiti dagli attivisti digitali per diffondere la propria ideologia."
                },
				{
                    "value": "IN",
                    "expanded": "Insider",
                    "description": "Insider identifica gli eventi cyber in cui un attaccante utilizza le proprie autorizzazioni o le conoscenze acquisite durante le consuete attività lavorative per compiere un attacco informatico dall’interno della rete dalla quale opera. L’obiettivo di un insider può essere ad esempio il furto di informazioni sensibili, il danneggiamento di un sistema, il sabotaggio dell’azienda o la vendita delle informazioni trafugate."
                },
				{
                    "value": "NA",
                    "expanded": "Nation state",
                    "description": "Nation state identifica gli eventi cyber condotti da entità o gruppi statuali o sponsorizzati dallo Stato, ossia gruppi che conducono operazioni cibernetiche avanzate per conto di un governo o di uno Stato sovrano. Questi attori sono sostenuti o autorizzati dal governo del loro paese per perseguire obiettivi di interesse nazionale attraverso attività di hacking, spionaggio o guerra cibernetica. Questa tipologia di avversario dispone solitamente di risorse significative, tra cui personale altamente qualificato, budget cospicui e accesso a strumenti e tecnologie avanzate."
                }
            ]
        },
        {
            "predicate": "AC:AB",
            "entry": [
                {
                    "value": "DI",
                    "expanded": "Disturbing content",
                    "description": "Disturbing content identifica qualsiasi tipo di materiale o informazione diffusa tramite sistemi informatici che può essere considerato offensivo, inappropriato, dannoso o che possa provocare disagio psicologico o emotivo."
                },
				{
                    "value": "HA",
                    "expanded": "Harmful speech",
                    "description": "Harmful speech identifica eventi qualsiasi forma di comunicazione espressa tramite piattaforme digitali che può causare danno, disagio o discriminazione a individui o gruppi. Tra questi, discorsi corredati da argomenti offensivi quali bullismo, molestie, mobbing, diffamazione o discriminazione contro uno o più soggetti, con il possibile intento di discreditare e/o diffamare pubblicamente la vittima."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi ad Abusive content non identificabili con gli altri valori definiti nel sottoinsieme."
                },
            ]
        },
        {
            "predicate": "AC:AS",
            "entry": [
                {
                    "value": "IT",
                    "expanded": "Italy",
                    "description": "Italy indica che i beni informatici da cui sono state condotte attività malevole o illecite sono localizzati sul territorio nazionale italiano."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other indica che i beni informatici da cui sono state condotte attività malevole o illecite sono localizzati al di fuori del territorio nazionale italiano."
                }
            ]
        },
        {
            "predicate": "AC:IN",
            "entry": [
                {
                    "value": "BU",
                    "expanded": "Business e mail",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato una o più caselle di posta elettronica aziendale, ad esempio: la compromissione della casella, la ricezione di una mail di phishing o spam, anche senza impatto, l’esposizione pubblica di caselle di posta aziendale a seguito di divulgazione, i tentativi di accesso alla casella di posta aziendale."
                },
				{
                    "value": "HY",
                    "expanded": "Hypervisor",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un hypervisor. Si definisce hypervisor un sistema che opera da host e consente la creazione e la gestione di una serie di macchine virtuali definite guest, isolandone il sistema operativo o le risorse. Tra questi rientrano, ad esempio, quelli in cui un attore malevolo ha ottenuto accesso all’hypervisor ed eseguito un ransomware, cifrando conseguentemente tutti i sistemi guest contenuti."
                },
				{
                    "value": "IN",
                    "expanded": "Industrial Control Systems",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema industriale. Si definisce Industrial Control System (ICS) un sistema informativo utilizzato per controllare processi industriali come la fabbricazione, la movimentazione dei prodotti, la produzione e la distribuzione."
                },
				{
                    "value": "IO",
                    "expanded": "IoT device",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un dispositivo IoT (Internet of Things). Si definisce dispositivo IoT un dispositivo fisico dotato di un sistema integrato che gli consente di adempiere a compiti predeterminati e di collegarsi ad una rete per interoperare e scambiare informazioni con altri sistemi. In generale, i dispositivi IoT sono oggetti di uso quotidiano quali per esempio elettrodomestici, veicoli, sensori o telecamere."
                },
				{
                    "value": "MO",
                    "expanded": "Mobile device",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un dispositivo mobile, come per esempio uno smartphone o un tablet."
                },
				{
                    "value": "NE",
                    "expanded": "Network device",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un qualsiasi dispositivo di rete, come ad esempio router e switch. Per i dispositivi network utilizzati nella gestione della sicurezza aziendale fare riferimento al valore Security appliance."
                },
				{
                    "value": "PE",
                    "expanded": "Personal e-mail",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato una casella di posta elettronica personale, ad esempio: la compromissione della casella, la ricezione di una mail di phishing o spam, anche senza impatto, l’esposizione pubblica di caselle di posta a seguito di divulgazione, i tentativi di accesso alla casella di posta aziendale."
                },
				{
                    "value": "PR",
                    "expanded": "Privileged account",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un account privilegiato. Si definisce account privilegiato un’utenza che ha un ruolo di alto livello in termini di autorizzazione nella gestione di un sistema informatico tale da modificarne le componenti critiche. Ad esempio: la compromissione di un account di amministratore locale o di dominio."
                },
				{
                    "value": "UN",
                    "expanded": "Unprivileged account",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un account senza privilegi. Si intende con “account senza privilegi” un utente con permessi limitati di accesso e di modifica a un sistema o a un’infrastruttura di rete. Un esempio è rappresentato da un attacco che è iniziato dalla compromissione di un account utente."
                },
				{
                    "value": "SR",
                    "expanded": "Server",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un server. Si definisce server un computer o un dispositivo che in una rete gestisce e fornisce risorse. Gli esempi includono file server (per archiviare file), server di stampa (per gestire una o più stampanti), server di posta (per gestire le caselle di posta elettronica) e server di database (per elaborare le query del database)."
                },
				{
                    "value": "SE",
                    "expanded": "Service or application",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato servizi o applicazioni. L’applicazione o il servizio può essere di qualunque natura, ivi incluse applicazioni Web, Mobile, Database, ecc."
                },
				{
                    "value": "SO",
                    "expanded": "Social media",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato account di social media. Un esempio è rappresentato da un attore malevolo che ha ottenuto in modo illecito le credenziali di un account social aziendale."
                },
				{
                    "value": "SA",
                    "expanded": "Security appliance",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un qualsiasi dispositivo utilizzato per proteggere i sistemi e la rete da traffico malevolo e tutti quei sistemi che concorrono alla gestione delle politiche di sicurezza come ad esempio: • Firewalls/Proxy; • Intrusion Protection Systems (IPS); • Unified Threat Management (UTM); • Network Access Control; • E-mail Security Gateways; • Web Application Firewalls (WAF); • VPN Gateways; • Network Device Backup and Recovery."
                },
				{
                    "value": "VP",
                    "expanded": "VPN account",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un account connesso ad un profilo Virtual Private Network (VPN). La VPN è una rete virtuale costruita su reti esistenti in grado di fornire un meccanismo di comunicazione sicuro per i dati e le informazioni IP trasmesse tra le reti. Un esempio di evento cyber, indicativo per tale valore, è rappresentato da una compromissione o da ripetuti tentativi di accesso non autorizzati di un account VPN utilizzato per accedere alle risorse interne aziendali."
                },
				{
                    "value": "WA",
                    "expanded": "Web application",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un’applicazione software che viene eseguita su un server web e fruibile tramite un browser. Alcuni esempi di eventi cyber che coinvolgono web application sono: SQL injection, Cross-Site-Scripting (XSS), Cross-Site-Request Forgery (CSRF), violazione di dati, defacement, session hijacking, etc."
                },
				{
                    "value": "WO",
                    "expanded": "Workstation",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato una o più postazioni di lavoro. Un esempio è rappresentato da una compromissione o movimento laterale iniziato da una workstation di un dipendente aziendale."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Involved asset non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "AC:OS",
            "entry": [
                {
                    "value": "AN",
                    "expanded": "Android",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo Google Android, in qualunque sua versione."
                },
				{
                    "value": "GN",
                    "expanded": "GNU/Linux",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo GNU/Linux, in qualunque sua versione."
                },
				{
                    "value": "IO",
                    "expanded": "iOS",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo Apple iOS, in qualunque sua versione."
                },
				{
                    "value": "MA",
                    "expanded": "MacOS",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo macOS, in qualunque sua versione."
                },
				{
                    "value": "MI",
                    "expanded": "Microsoft Windows",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo Microsoft Windows in qualunque sua versione, anche server."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "L’utilizzo di tale valore specifica se l’evento ha interessato un sistema operativo, in qualunque sua versione, diverso da quelli definiti in questo sottoinsieme (ad esempio: sistemi basati su BSD, Solaris, o sistemi operativi proprietari sviluppati da altri produttori)."
                }
            ]
        },
        {
            "predicate": "AC:OU",
            "entry": [
                {
                    "value": "IM",
                    "expanded": "Improving",
                    "description": "Improving identifica un evento cyber in corso per il quale si prevede una riduzione dell’impatto nelle successive sei ore dal momento del rilevamento."
                },
				{
                    "value": "ST",
                    "expanded": "Stable",
                    "description": "Stable identifica un evento cyber in corso per il quale si prevede che l’impatto rimanga invariato nelle successive sei ore dal momento del rilevamento."
                },
				{
                    "value": "WO",
                    "expanded": "Worsening",
                    "description": "Worsening identifica un evento cyber in corso per il quale si prevede che l’impatto si aggravi nelle successive sei ore dal momento del rilevamento."
                }
            ]
        },
        {
            "predicate": "AC:PH",
            "entry": [
                {
                    "value": "SA",
                    "expanded": "Sabotage",
                    "description": "Sabotage identifica qualsiasi azione intenzionale volta a danneggiare, distruggere o alterare il funzionamento della risorsa informatica o parti di questa. Queste azioni sono compiute con lo scopo di causare la perdita totale o parziale della disponibilità della risorsa informatica."
                },
				{
                    "value": "TH",
                    "expanded": "Theft and burglary",
                    "description": "Theft and bulglary identifica gli eventi cyber conseguenti al furto di un bene informatico o parti di esso."
                },
				{
                    "value": "UN",
                    "expanded": "Unauthorized access",
                    "description": "Unauthorized access identica gli eventi cyber che si verificano quando chiunque ottiene, senza autorizzazione, accesso fisico ad un bene informatico."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Physical security non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
        {
            "predicate": "AC:VE",
            "entry": [
                {
                    "value": "AB",
                    "expanded": "Abuse of functionality",
                    "description": "Abuse of functionality identifica gli eventi cyber in cui un attore malevolo sfrutta in modo intenzionale e non convenzionale le funzionalità fornite da un’applicazione o un sito web. In altri termini, può essere descritto come l’abuso di una funzionalità di un’applicazione per ottenere un risultato indesiderato. Ad esempio, nel caso in cui il processo di recupero password non venga implementato nella maniera corretta, un attore malevolo sarà in grado di recuperare informazioni d’interesse (come indirizzo e-mail o nome dell’account)."
                },
				{
                    "value": "CO",
                    "expanded": "Compromised domain",
                    "description": "Compromised domain specifica se l’evento ha interessato un dominio internet lecito che viene utilizzato per veicolare attacchi informatici, quali ad esempio la distribuzione di malware, reindirizzamento della navigazione verso risorse malevole, truffe a danno di soggetti target come il furto di dati personali tramite pagine web illecitamente predisposte."
                },
				{
                    "value": "DR",
                    "expanded": "Drive-by compromise",
                    "description": "Drive-by compromise identifica gli eventi cyber in cui un utente, tramite la navigazione di un sito web, viene esposto a possibili attacchi, ad esempio tramite lo sfruttamento di vulnerabilità applicative del dispositivo utilizzato o tramite l’uso di codice malevolo, finalizzato alla distribuzione di malware o al furto di token validi per l’accesso applicativo."
                },
				{
                    "value": "E-",
                    "expanded": "E-mail",
                    "description": "E-mail identifica gli eventi cyber che utilizzano come vettore d’attacco una casella di posta elettronica (PEC, PEL o PEO)."
                },
				{
                    "value": "EV",
                    "expanded": "Exploiting vulnerabilities",
                    "description": "Exploiting vulnerabilities identifica gli eventi cyber in cui un attaccante tenta o riesce a sfruttare, sia da internet sia da rete interna, vulnerabilità di un bene informatico al fine di accedervi e ottenerne il controllo illecitamente. Questo valore include sia lo sfruttamento di vulnerabilità note, documentate sul database delle CVE (Common Vulnerabilities and Exposures), sia lo sfruttamento di quelle non note, altresì dette vulnerabilità “0-day”."
                },
				{
                    "value": "EX",
                    "expanded": "External remote services",
                    "description": "External remote services identifica gli eventi cyber in cui un attore malevolo sfrutta i servizi remoti esposti per accedere e/o persistere all’interno di un bene informatico. Si annoverano in tale categoria tutti quei servizi e meccanismi di accesso che consentono agli utenti di connettersi remotamente alle risorse della rete aziendale. L’abuso di tali servizi può avvenire tramite errate configurazioni, vulnerabilità o l’uso di credenziali valide, per le quali è possibile fare riferimento agli ulteriori e specifici elementi della tassonomia."
                },
				{
                    "value": "HA",
                    "expanded": "Hardware additions",
                    "description": "Hardware additions identifica gli eventi cyber in cui un attore malevolo utilizza, in modo non autorizzato, dispositivi hardware per eseguire azioni malevole o illecite, ad esempio per accedere ad un bene informatico o intercettare dati sensibili. Un esempio possono essere gli strumenti utilizzati per catturare informazioni, distribuzione malware tramite storage rimovibile o monitorare senza consenso le attività svolte dalla vittima."
                },
				{
                    "value": "SO",
                    "expanded": "Social media",
                    "description": "Social media identifica gli eventi cyber che utilizzano come vettore d’attacco una piattaforma social per perpetrare attività malevole. Tale valore può riferirsi anche alla pubblicazione di contenuti non autorizzati a seguito di accesso sospetto alla piattaforma social in uso."
                },
				{
                    "value": "SU",
                    "expanded": "Supply chain",
                    "description": "Supply chain identifica gli eventi cyber che utilizzano come vettore d’attacco prodotti o servizi forniti da terze parti all’interno della catena di approvvigionamento, che presentano vulnerabilità o che sono stati compromessi prima della distribuzione all’utente finale. Nella fattispecie i criminali informatici possono manomettere la produzione o la distribuzione di un prodotto, hardware o software, installando malware o altri componenti, con lo scopo danneggiare uno o più soggetti, prendendo di mira uno o più elementi della catena di approvvigionamento."
                },
				{
                    "value": "VA",
                    "expanded": "Valid accounts",
                    "description": "Valid accounts identifica gli eventi cyber che utilizzano come vettore d’attacco un account valido. L’attaccante può sfruttare a proprio vantaggio e illecitamente le autorizzazioni dell’utenza interessata per effettuare attività malevole come ad esempio ottenere privilegi superiori, attivare persistenza, sottrarre illecitamente informazioni o eseguire codice non autorizzato. Questo tipo di evento può coinvolgere sia utenze privilegiate sia non, per le quali specifiche si rimanda ai relativi valori della tassonomia."
                },
				{
                    "value": "OT",
                    "expanded": "Other",
                    "description": "Other identifica gli eventi cyber relativi a Vector non identificabili con gli altri valori definiti nel sottoinsieme."
                }
            ]
        },
    ]
}